pygraph-cli (0.1.0)                                        - CLI for pygraphviz powered by graphviz
graphic-verification-code (1.0.0)                    
codegrapher (0.2.1)                                        - Code that graphs code
codeink (1.0)                                              - codeink draws your Python source code into beautiful graph
                                                             structures

															                                                              Engine
neo4j-embedded (1.9.c2)                                    - Bindings for the embedded version of the neo4j graph
                                                             database.
emit (0.4.0)                                               - Build a graph to process streams
encrypted-storage (1.0.2)                                  - Easy, cryptographically secure storage on numerous database
                                                             backends.
wxSFTP (0.3)                                               - Graphical SFTP client

vsgui (0.3.3)                                              - Very Simple Graphical library for Python shell script
vue4j (0.1)                                                - A graph data extraction and Neo4j conversion tool for VUE.
warden (0.0.1a)                                            - A set of tools for monitoring Python applications, and
                                                             shipping events to Sentry and metrics to Graphite
visibility_graph (0.4)                                     - From time series to graph thru visibility algorithm.
vectorformats (0.1)                                        - geographic data serialization/deserialization library
vert (1.0.1)                                               - Universal Graph Interface for Python
vincenty (0.1.4)                                           - Calculate the geographical distance between 2 points with
                                                             extreme accuracy.
torus (0.7.1)                                              - Carbon and Graphite replacement using Kairos for timeseries
                                                             storage
tri (0.3)                                                  - (Constrained) Delaunay Triangulation of Planar Straight Line
                                                             Graphs (pure Python)
tinyfeedback (0.2.0)                                       - A simple graphing web-based dashboard
tinysvg (0.0.3)                                            - tinysvg is a thin implementation of svg within python along
    tergraw (0.3.1)                                            - Draw graphs in terminal
                                                         with simple turtle graphics. Not production stable.
synapse (0.0.14)                                           - Synapse Distributed Key-Value Hypergraph Analysis Framework
streamplot (1.0)                                           - Real Time Plots with pyqtgraph
salt_state_graph (0.0.1)                                   - a tool to represent salt states and their dependencies as an
                                                             acyclic graph
redis_graph (1.0)                                          - Python graph database implemented on top of Redis.
redicrypt (0.0.9)                                          - Python-based cryptography package for redis.
pyvisgraph (0.1.4)                                         - Given a set of simple obstacle polygons, build a visibility
                                                             graph and find the shortest path between two points.
pyrgraph (0.1.2)                                           - Pyrgraph is a Redis-backed graph database
pygraphql (0.0.1)                                          -
pygraphviz (1.4rc1)                                        - Python interface to Graphviz
pygr (0.8.2)                                               - Pygr, a Python graph-database toolkit oriented primarily on
                                                             bioinformatics applications
pygraf (1.02)                                              - Python Graph library
pygraph_redis (0.2.1)                                      - Python Library to manipulate directed graphs in redis
pygraphflow (0.1.1.2)                                      - A driver for GraphFlow DB
pygoo (0.1.4)                                              - PyGoo is an Object-Graph mapper, similar to SQLAlchemy but
pygmount (0.9.3)                                           - Software for graphical mount network shares.
pyflamegraph (0.0.2)                                       - Wrapper around flamegraph.pl.
pyflowgraph (0.0.2)                                        - An interactive data flow graph editor
pygal (2.3.1)                                              - A python svg graph plotting library
pydot (1.2.3)                                              - Python interface to Graphviz's Dot
pydot3 (1.0.9)                                             - Python 3 interface to Graphviz's Dot
pydot3k (1.0.17)                                           - Python interface to Graphviz's Dot
pydot_modern (1.0.29)                                      - Python interface to Graphviz's Dot
pydotplus (2.0.2)                                          - Python interface to Graphviz's Dot language
pyconnectedcomponent (0.1.3)                               - simple connected component tool from
                                                             http://breakingcode.wordpress.com/2013/04/08/finding-
                                                             connected-components-in-a-graph/
PyConsoleGraphics (0.1)                                    - Portable, easy text-mode graphics
polygraph (0.1.0)                                          - Python library for defining GraphQL schemas
pinggraph (0.0.13)                                         - Ping, but with a graph. Visit the Github page for more info
pip-spark (0.1)                                            - Graphing on the command line, from Holman
pipviewer (0.3.9)                                          - graphically display conservation on a multiple alignment
nxanimate (0.1)                                            - Graph algorithms animation tool. Like Gato, but based on
                                                             NetworkX.
nxbimatch (0.20130323)                                     - generation of matchings in bipartite graphs
networkl (0.2.13)                                          - NetworkL is a Python package which extends the scope of the
                                                             NetworkX package to eXtra-Large time-varying graphs. It
                                                             supports the manipulation and efficient longitudinal analysis
                                                             of complex networks
networkx (1.11)                                            - Python package for creating and manipulating graphs and
                                                             networks
networkx_viewer (0.2.0)                                    - Interactive viewer for networkx graphs.
pydot-ng (1.0.0)                                           - Python interface to Graphviz's Dot
nvector (0.5.2)                                            - Solves all kinds of geographical position calculations.
neo4py (0.1)                                               - Python bindings for Neo4j graph database
neomodel (3.2.2)                                           - An object mapper for the neo4j graph database.
neonx (0.1.1)                                              - Handles conversion of date from NetworkX graph to Neo4j
lokey (0.5.0)                                              - A tool to convert between different cryptographic key formats
guidata (1.7.6)                                            - Automatic graphical user interfaces generation for easy
                                                             dataset editing and display
gunny (1.0.0b2)                                            - Python package for executing commands by following a directed
                                                             graph
graphviz-python (2.32.0)                                   - python language binding for graphviz
jirafs-graphviz (2.0)                                      - Automatically convert graphviz DOT files into PNG images when
                                                             uploading to JIRA
graphviz (0.6)                                             - Simple Python interface for Graphviz
GraphvizAnim (0.2-alpha)                                   - A tool to create animated graph visualizations, based on
                                                             graphviz
graphlib (0.9.5)                                           - Graph API
graphlibrary (1.0.0)                                       - Library for working with graphs
graphlite (1.0.5)                                          - embedded graph datastore
GraphDash (0.9.3)                                          - A web-based dashboard built on graphs and their met
GraphGit (0.2.0)                                           - Git repository graph generator
graphics (1.1)                                             - A console based graphics engine for simple Unicode games and
                                                             animations.
gns3-gui (2.0.0rc4)                                        - GNS3 graphical interface for the GNS3 server.
                                                             Enterprise (DSE)
flamegraph (0.1)                                           - Statistical profiler which outputs in format suitable for
                                                             FlameGraph
vmprof-flamegraph (0.0.1)                                  - Convert vmprof data into flamegraph format
flask-simple-login (0.0.1)                                 - Easily turn your python data into a flot graph in a static
                                                             html file.
graphql-flask (1.1.0)                                      - Adds GraphQL support to your Flask application
flask-graphql-subscriptions-transport (0.1.4)              - Adds subscription transport layer for Flask applications
                                                             using GraphQL
Flask-GraphQL (1.4.1)                                      - Adds GraphQL support to your Flask application
dot2tex (2.9.0)                                            - A Graphviz to LaTeX converter
dotfigure (0.4)                                            - DOT graph figures for reStructuredText
dotter (0.5.0)                                             - Dotter is a graphviz wrapper for Python 2 and 3
eea.alchemy (6.4)                                          - EEA Alchemy allows you to bulk auto-discover geographical
                                                             coverage, temporal coverage, keywords and more
eea.geotags (8.1)                                          - EEA Geotags package redefines the location field in Plone.
                                                             Right now in Plone location field is a free text field. EEA
                                                             Geotags lets you easy define locations using a map picker and
                                                             http://geonames.org geographical database.
yubioath-desktop (3.1.0)                                   - Graphical interface for displaying OATH codes with a Yubikey
Graphviz-Datasource (0.1)                                  - Datasource for google graphviz
NetFlowVizu (0.6)      - Network flow visualizer.
ipfix (0.9.7)  - IPFIX implementation for Python 3.3+



MATCH (a:Person),(b:Person)
WHERE a.name = 'Node A' AND b.name = 'Node B'
CREATE (a)-[r:RELTYPE { name : a.name + '<->' + b.name }]->(b)
RETURN r


neo4j-sh (?)$ begin
Transaction started
neo4j-sh (?)$ create (:NetElm {name:'sw1',ipv4:'192.168.13.5'});
+-------------------+
| No data returned. |
+-------------------+
Nodes created: 1
Properties set: 2
Labels added: 1
204 ms
neo4j-sh (?)$ create (:NetElm {name:'sw2',ipv4:'192.168.13.6'});
+-------------------+
| No data returned. |
+-------------------+
Nodes created: 1
Properties set: 2
Labels added: 1
15 ms
neo4j-sh (?)$ start r=rel(*) return count(r);

neo4j-sh (?)$ start r=node(*) return r;
+-----------------------------------------+
| r                                       |
+-----------------------------------------+
| Node[2]{name:"sw1",ipv4:"192.168.13.5"} |
| Node[3]{name:"sw2",ipv4:"192.168.13.6"} |
+-----------------------------------------+
2 rows
27 ms
neo4j-sh (?)$  create (:IntElm {name:'sw1'})
> ;
+-------------------+
| No data returned. |
+-------------------+
Nodes created: 1
Properties set: 1
Labels added: 1
73 ms
neo4j-sh (?)$ start r=node(*) return r;
+-----------------------------------------+
| r                                       |
+-----------------------------------------+
| Node[2]{name:"sw1",ipv4:"192.168.13.5"} |
| Node[3]{name:"sw2",ipv4:"192.168.13.6"} |
| Node[4]{name:"sw1"}                     |
+-----------------------------------------+
3 rows
10 ms
neo4j-sh (?)$ match (a:NetElm), (b:IntElm) where a.name = 'sw1' and b.name = 'sw1' create (a)-[r:RELTYPE]->(b)
> return r;
+---------------+
| r             |
+---------------+
| :RELTYPE[0]{} |
+---------------+

neo4j-sh (?)$ start r=rel(*) return r;
+---------------+
| r             |
+---------------+
| :RELTYPE[0]{} |
+---------------+
1 row
16 ms
neo4j> CREATE (:Person {name : 'Dick Grayson', alias : {thisAlias} });
Added 1 nodes, Set 2 properties, Added 1 labels
neo4j> MATCH (n) RETURN n;
n

neo4j> CREATE (:Person {name : 'Dick Grayson', alias : {thisAlias} });
Added 1 nodes, Set 2 properties, Added 1 labels
neo4j> MATCH (n) RETURN n;
n
(:Person {name: "Bruce Wayne", alias: "Batman"})
(:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]})
(:Person {name: "Dick Grayson", alias: "Robin"})

(:NetElm {name: "sw1", ipv4: "192.168.13.5"})
(:NetElm {name: "sw2", ipv4: "192.168.13.6"})
(:IntElm {name: "sw1", IntName: "gi0/1"})
(:IntElm {name: "sw1", IntName: "gi0/2"})
(:IntElm {name: "sw2", IntName: "gi0/1"})
(:IntElm {name: "sw2", IntName: "gi0/2"})
(:Maclist {name: "sw1", IntName: "gi0/1", mac: ["01:00:00:ff:ff:1f", "01:00:00:ff:ff:1d", "01:00:00:ff:ff:1c" } )
(:Maclist {name: "sw2", IntName: "gi0/1", mac: ["01:00:00:ff:fe:1f", "01:00:00:ff:fe:1d", "01:00:00:ff:fe:1c" } )